#!/usr/bin/env python3

import os
import time
import subprocess
from selenium import webdriver

import CMS_PYTHON_LOGIN
import CMS_PYTHON_TECHPLUS_SET_INIT_VALS
import CMS_PYTHON_TECHPLUS_UPLOAD_DATA

#========================================================================
# TECH+記事をCMSへ入稿する
#========================================================================

#========================================================================
# Google Chrome WebDriverを起動
#========================================================================
subprocess.call('webdriver_chrome_start')
driver = webdriver.Chrome()

#========================================================================
# CMSへログイン
#========================================================================
CMS_PYTHON_LOGIN.doit(driver)

#========================================================================
# TECH+ニュース記事の新規作成
#========================================================================
print('TECH+ニュース記事新規作成処理をはじめます。')
driver.get('https://manage.news.mynavi.jp/admin/projects/new_techplus')

# ページ読み込みを待機（2秒では失敗したので、ひとまず5秒に設定）
time.sleep(5)

#========================================================================
# 必要項目を設定
#========================================================================
print('必要項目を設定します。')
CMS_PYTHON_TECHPLUS_SET_INIT_VALS.doit(driver)

#========================================================================
# 入稿フローを実施
#========================================================================
print('記事データのアップロード処理を開始します。')
CMS_PYTHON_TECHPLUS_UPLOAD_DATA.doit(driver)

#========================================================================
# ニュース記事の新規作成ページにおける不要な要素を非表示に設定
#========================================================================
print('作業に必要ない要素を非表示へ変更します。')

#========================================================================
# Google Chrome Webドライバを終了
#========================================================================
#subprocess.call('webdriver_chrome_stop.ps1')
